export default {
    "1.0.2": ["新增更新详情弹框", "顶栏增加版本展示", "支持选择主题色"],
    "1.1.0": ["侧边栏优化", "右键菜单弹出位置优化", "文件管理器滚动条修复", "文件管理器增加底部状态条",
        "文件可以支持选择了", "支持回车键确定密码", "任务管理器支持状态显示", "修复bug", "列表查找性能优化"],
    "1.2.0": ["文件哈希现已开放", "新增功能：屏幕捕获防护", "更新内容UI展示优化"],
    "1.3.0": ["支持窗口锁定（应用锁）"],
    "1.3.1": ['应用锁bug修复'],
    "1.4.0": ['支持从外部拖入文件以导入', "完全重写加密引擎，支持异步加密，且显著优化输出文件大小", "改正一处错别字", "临时文件自动销毁"],
    "1.5.0": ['若干bug和细节修复', '任务处理并行化，显著提高运行效率', '支持导出文件', '支持快捷打开store所在的目录'],
    "2.0.0": ['若干bug和细节修复', '增加内置文件选择器', '内置浏览器可用', '内置代码编辑器可用'],
}
